Revit 2027 API
ElectricalLoadClassification.LoadSummaryDemandFactorLabel Property
 The name template for the demand factor parameter of the load classification.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string LoadSummaryDemandFactorLabel { get; set; }
Public Property LoadSummaryDemandFactorLabel As String
	Get
	Set
public:
property String^ LoadSummaryDemandFactorLabel {
	String^ get ();
	void set (String^ value);
}
member LoadSummaryDemandFactorLabel : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentException |  When setting this property: loadSummaryDemandFactorLabel is not a valid globalization format string.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ElectricalLoadClassification Class
Autodesk.Revit.DB.Electrical Namespace